RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_emu.h
/* Bit fields for EMU R5VCTRL */
#define _EMU_R5VCTRL_RESETVALUE                              0x00000000UL                          /**< Default value for EMU_R5VCTRL */
#define _EMU_R5VCTRL_MASK                                    0x00000307UL                          /**< Mask for EMU_R5VCTRL */
#define EMU_R5VCTRL_BYPASS                                   (0x1UL << 0)                          /**< 5V Regulator Bypass */
#define _EMU_R5VCTRL_BYPASS_SHIFT                            0                                     /**< Shift value for EMU_BYPASS */
#define _EMU_R5VCTRL_BYPASS_MASK                             0x1UL                                 /**< Bit mask for EMU_BYPASS */
#define _EMU_R5VCTRL_BYPASS_DEFAULT                          0x00000000UL                          /**< Mode DEFAULT for EMU_R5VCTRL */
#define EMU_R5VCTRL_BYPASS_DEFAULT                           (_EMU_R5VCTRL_BYPASS_DEFAULT << 0)    /**< Shifted mode DEFAULT for EMU_R5VCTRL */
#define EMU_R5VCTRL_EM4WUEN                                  (0x1UL << 1)                          /**< Enable EM4 Wakeup Due to VBUS Detection */
#define _EMU_R5VCTRL_EM4WUEN_SHIFT                           1                                     /**< Shift value for EMU_EM4WUEN */
#define _EMU_R5VCTRL_EM4WUEN_MASK                            0x2UL                                 /**< Bit mask for EMU_EM4WUEN */
#define _EMU_R5VCTRL_EM4WUEN_DEFAULT                         0x00000000UL                          /**< Mode DEFAULT for EMU_R5VCTRL */
#define EMU_R5VCTRL_EM4WUEN_DEFAULT                          (_EMU_R5VCTRL_EM4WUEN_DEFAULT << 1)   /**< Shifted mode DEFAULT for EMU_R5VCTRL */
#define EMU_R5VCTRL_IMONEN                                   (0x1UL << 2)                          /**< Enable the Regulator Current Monitor for Selected Current Path to Either VREGI or VBUS */
#define _EMU_R5VCTRL_IMONEN_SHIFT                            2                                     /**< Shift value for EMU_IMONEN */
#define _EMU_R5VCTRL_IMONEN_MASK                             0x4UL                                 /**< Bit mask for EMU_IMONEN */
#define _EMU_R5VCTRL_IMONEN_DEFAULT                          0x00000000UL                          /**< Mode DEFAULT for EMU_R5VCTRL */
#define EMU_R5VCTRL_IMONEN_DEFAULT                           (_EMU_R5VCTRL_IMONEN_DEFAULT << 2)    /**< Shifted mode DEFAULT for EMU_R5VCTRL */
#define _EMU_R5VCTRL_INPUTMODE_SHIFT                         8                                     /**< Shift value for EMU_INPUTMODE */
#define _EMU_R5VCTRL_INPUTMODE_MASK                          0x300UL                               /**< Bit mask for EMU_INPUTMODE */
#define _EMU_R5VCTRL_INPUTMODE_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for EMU_R5VCTRL */
#define _EMU_R5VCTRL_INPUTMODE_AUTO                          0x00000000UL                          /**< Mode AUTO for EMU_R5VCTRL */
#define _EMU_R5VCTRL_INPUTMODE_VBUS                          0x00000001UL                          /**< Mode VBUS for EMU_R5VCTRL */
#define _EMU_R5VCTRL_INPUTMODE_VREGI                         0x00000002UL                          /**< Mode VREGI for EMU_R5VCTRL */
#define EMU_R5VCTRL_INPUTMODE_DEFAULT                        (_EMU_R5VCTRL_INPUTMODE_DEFAULT << 8) /**< Shifted mode DEFAULT for EMU_R5VCTRL */
#define EMU_R5VCTRL_INPUTMODE_AUTO                           (_EMU_R5VCTRL_INPUTMODE_AUTO << 8)    /**< Shifted mode AUTO for EMU_R5VCTRL */
#define EMU_R5VCTRL_INPUTMODE_VBUS                           (_EMU_R5VCTRL_INPUTMODE_VBUS << 8)    /**< Shifted mode VBUS for EMU_R5VCTRL */
#define EMU_R5VCTRL_INPUTMODE_VREGI                          (_EMU_R5VCTRL_INPUTMODE_VREGI << 8)   /**< Shifted mode VREGI for EMU_R5VCTRL */

/* Bit fields for EMU R5VADCCTRL */
#define _EMU_R5VADCCTRL_RESETVALUE                           0x00000000UL                               /**< Default value for EMU_R5VADCCTRL */
#define _EMU_R5VADCCTRL_MASK                                 0x0000F001UL                               /**< Mask for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_ENAMUX                                (0x1UL << 0)                               /**< Enable the 5V Subsystem ADC MUX */
#define _EMU_R5VADCCTRL_ENAMUX_SHIFT                         0                                          /**< Shift value for EMU_ENAMUX */
#define _EMU_R5VADCCTRL_ENAMUX_MASK                          0x1UL                                      /**< Bit mask for EMU_ENAMUX */
#define _EMU_R5VADCCTRL_ENAMUX_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_ENAMUX_DEFAULT                        (_EMU_R5VADCCTRL_ENAMUX_DEFAULT << 0)      /**< Shifted mode DEFAULT for EMU_R5VADCCTRL */
#define _EMU_R5VADCCTRL_AMUXSEL_SHIFT                        12                                         /**< Shift value for EMU_AMUXSEL */
#define _EMU_R5VADCCTRL_AMUXSEL_MASK                         0xF000UL                                   /**< Bit mask for EMU_AMUXSEL */
#define _EMU_R5VADCCTRL_AMUXSEL_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for EMU_R5VADCCTRL */
#define _EMU_R5VADCCTRL_AMUXSEL_VBUSDIV10                    0x00000000UL                               /**< Mode VBUSDIV10 for EMU_R5VADCCTRL */
#define _EMU_R5VADCCTRL_AMUXSEL_VREGIDIV10                   0x00000001UL                               /**< Mode VREGIDIV10 for EMU_R5VADCCTRL */
#define _EMU_R5VADCCTRL_AMUXSEL_VREGODIV6                    0x00000002UL                               /**< Mode VREGODIV6 for EMU_R5VADCCTRL */
#define _EMU_R5VADCCTRL_AMUXSEL_VREGIIMON                    0x00000003UL                               /**< Mode VREGIIMON for EMU_R5VADCCTRL */
#define _EMU_R5VADCCTRL_AMUXSEL_VBUSIMON                     0x00000004UL                               /**< Mode VBUSIMON for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_AMUXSEL_DEFAULT                       (_EMU_R5VADCCTRL_AMUXSEL_DEFAULT << 12)    /**< Shifted mode DEFAULT for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_AMUXSEL_VBUSDIV10                     (_EMU_R5VADCCTRL_AMUXSEL_VBUSDIV10 << 12)  /**< Shifted mode VBUSDIV10 for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_AMUXSEL_VREGIDIV10                    (_EMU_R5VADCCTRL_AMUXSEL_VREGIDIV10 << 12) /**< Shifted mode VREGIDIV10 for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_AMUXSEL_VREGODIV6                     (_EMU_R5VADCCTRL_AMUXSEL_VREGODIV6 << 12)  /**< Shifted mode VREGODIV6 for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_AMUXSEL_VREGIIMON                     (_EMU_R5VADCCTRL_AMUXSEL_VREGIIMON << 12)  /**< Shifted mode VREGIIMON for EMU_R5VADCCTRL */
#define EMU_R5VADCCTRL_AMUXSEL_VBUSIMON                      (_EMU_R5VADCCTRL_AMUXSEL_VBUSIMON << 12)   /**< Shifted mode VBUSIMON for EMU_R5VADCCTRL */

/* Bit fields for EMU R5VOUTLEVEL */
#define _EMU_R5VOUTLEVEL_RESETVALUE                          0x00000001UL                             /**< Default value for EMU_R5VOUTLEVEL */
#define _EMU_R5VOUTLEVEL_MASK                                0x0000000FUL                             /**< Mask for EMU_R5VOUTLEVEL */
#define _EMU_R5VOUTLEVEL_OUTLEVEL_SHIFT                      0                                        /**< Shift value for EMU_OUTLEVEL */
#define _EMU_R5VOUTLEVEL_OUTLEVEL_MASK                       0xFUL                                    /**< Bit mask for EMU_OUTLEVEL */
#define _EMU_R5VOUTLEVEL_OUTLEVEL_DEFAULT                    0x00000001UL                             /**< Mode DEFAULT for EMU_R5VOUTLEVEL */
#define EMU_R5VOUTLEVEL_OUTLEVEL_DEFAULT                     (_EMU_R5VOUTLEVEL_OUTLEVEL_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_R5VOUTLEVEL */

/* Bit fields for EMU R5VDETCTRL */
#define _EMU_R5VDETCTRL_RESETVALUE                           0x00000000UL                               /**< Default value for EMU_R5VDETCTRL */
#define _EMU_R5VDETCTRL_MASK                                 0x00000007UL                               /**< Mask for EMU_R5VDETCTRL */
#define EMU_R5VDETCTRL_VREGIDETDIS                           (0x1UL << 0)                               /**< VREGI Detector Disable */
#define _EMU_R5VDETCTRL_VREGIDETDIS_SHIFT                    0                                          /**< Shift value for EMU_VREGIDETDIS */
#define _EMU_R5VDETCTRL_VREGIDETDIS_MASK                     0x1UL                                      /**< Bit mask for EMU_VREGIDETDIS */
#define _EMU_R5VDETCTRL_VREGIDETDIS_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for EMU_R5VDETCTRL */
#define EMU_R5VDETCTRL_VREGIDETDIS_DEFAULT                   (_EMU_R5VDETCTRL_VREGIDETDIS_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_R5VDETCTRL */
#define EMU_R5VDETCTRL_VBUSDETDIS                            (0x1UL << 1)                               /**< VBUS Detector Disable */
#define _EMU_R5VDETCTRL_VBUSDETDIS_SHIFT                     1                                          /**< Shift value for EMU_VBUSDETDIS */
#define _EMU_R5VDETCTRL_VBUSDETDIS_MASK                      0x2UL                                      /**< Bit mask for EMU_VBUSDETDIS */
#define _EMU_R5VDETCTRL_VBUSDETDIS_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for EMU_R5VDETCTRL */
#define EMU_R5VDETCTRL_VBUSDETDIS_DEFAULT                    (_EMU_R5VDETCTRL_VBUSDETDIS_DEFAULT << 1)  /**< Shifted mode DEFAULT for EMU_R5VDETCTRL */
#define EMU_R5VDETCTRL_VREGODETDIS                           (0x1UL << 2)                               /**< VREGO Detector Disable */
#define _EMU_R5VDETCTRL_VREGODETDIS_SHIFT                    2                                          /**< Shift value for EMU_VREGODETDIS */
#define _EMU_R5VDETCTRL_VREGODETDIS_MASK                     0x4UL                                      /**< Bit mask for EMU_VREGODETDIS */
#define _EMU_R5VDETCTRL_VREGODETDIS_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for EMU_R5VDETCTRL */
#define EMU_R5VDETCTRL_VREGODETDIS_DEFAULT                   (_EMU_R5VDETCTRL_VREGODETDIS_DEFAULT << 2) /**< Shifted mode DEFAULT for EMU_R5VDETCTRL */

/* Bit fields for EMU DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_RESETVALUE                        0x00000300UL                                       /**< Default value for EMU_DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_MASK                              0x0000F300UL                                       /**< Mask for EMU_DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_LPCMPBIASEM01_SHIFT               8                                                  /**< Shift value for EMU_LPCMPBIASEM01 */
#define _EMU_DCDCLPEM01CFG_LPCMPBIASEM01_MASK                0x300UL                                            /**< Bit mask for EMU_LPCMPBIASEM01 */
#define _EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS0               0x00000000UL                                       /**< Mode BIAS0 for EMU_DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS1               0x00000001UL                                       /**< Mode BIAS1 for EMU_DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS2               0x00000002UL                                       /**< Mode BIAS2 for EMU_DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_LPCMPBIASEM01_DEFAULT             0x00000003UL                                       /**< Mode DEFAULT for EMU_DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS3               0x00000003UL                                       /**< Mode BIAS3 for EMU_DCDCLPEM01CFG */
#define EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS0                (_EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS0 << 8)      /**< Shifted mode BIAS0 for EMU_DCDCLPEM01CFG */
#define EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS1                (_EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS1 << 8)      /**< Shifted mode BIAS1 for EMU_DCDCLPEM01CFG */
#define EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS2                (_EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS2 << 8)      /**< Shifted mode BIAS2 for EMU_DCDCLPEM01CFG */
#define EMU_DCDCLPEM01CFG_LPCMPBIASEM01_DEFAULT              (_EMU_DCDCLPEM01CFG_LPCMPBIASEM01_DEFAULT << 8)    /**< Shifted mode DEFAULT for EMU_DCDCLPEM01CFG */
#define EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS3                (_EMU_DCDCLPEM01CFG_LPCMPBIASEM01_BIAS3 << 8)      /**< Shifted mode BIAS3 for EMU_DCDCLPEM01CFG */
#define _EMU_DCDCLPEM01CFG_LPCMPHYSSELEM01_SHIFT             12                                                 /**< Shift value for EMU_LPCMPHYSSELEM01 */
#define _EMU_DCDCLPEM01CFG_LPCMPHYSSELEM01_MASK              0xF000UL                                           /**< Bit mask for EMU_LPCMPHYSSELEM01 */
#define _EMU_DCDCLPEM01CFG_LPCMPHYSSELEM01_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for EMU_DCDCLPEM01CFG */
#define EMU_DCDCLPEM01CFG_LPCMPHYSSELEM01_DEFAULT            (_EMU_DCDCLPEM01CFG_LPCMPHYSSELEM01_DEFAULT << 12) /**< Shifted mode DEFAULT for EMU_DCDCLPEM01CFG */

/* Bit fields for EMU R5VSTATUS */
#define _EMU_R5VSTATUS_RESETVALUE                            0x00000020UL                                /**< Default value for EMU_R5VSTATUS */
#define _EMU_R5VSTATUS_MASK                                  0x0000003FUL                                /**< Mask for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VREGIDET                               (0x1UL << 0)                                /**< VREGI Detected */
#define _EMU_R5VSTATUS_VREGIDET_SHIFT                        0                                           /**< Shift value for EMU_VREGIDET */
#define _EMU_R5VSTATUS_VREGIDET_MASK                         0x1UL                                       /**< Bit mask for EMU_VREGIDET */
#define _EMU_R5VSTATUS_VREGIDET_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VREGIDET_DEFAULT                       (_EMU_R5VSTATUS_VREGIDET_DEFAULT << 0)      /**< Shifted mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VBUSDET                                (0x1UL << 1)                                /**< USB VBUS Detected */
#define _EMU_R5VSTATUS_VBUSDET_SHIFT                         1                                           /**< Shift value for EMU_VBUSDET */
#define _EMU_R5VSTATUS_VBUSDET_MASK                          0x2UL                                       /**< Bit mask for EMU_VBUSDET */
#define _EMU_R5VSTATUS_VBUSDET_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VBUSDET_DEFAULT                        (_EMU_R5VSTATUS_VBUSDET_DEFAULT << 1)       /**< Shifted mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VREGODET                               (0x1UL << 2)                                /**< VREGO Detected */
#define _EMU_R5VSTATUS_VREGODET_SHIFT                        2                                           /**< Shift value for EMU_VREGODET */
#define _EMU_R5VSTATUS_VREGODET_MASK                         0x4UL                                       /**< Bit mask for EMU_VREGODET */
#define _EMU_R5VSTATUS_VREGODET_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VREGODET_DEFAULT                       (_EMU_R5VSTATUS_VREGODET_DEFAULT << 2)      /**< Shifted mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VBUSGTVREGI                            (0x1UL << 3)                                /**< Output of the Supply Comparator Between VBUS and VREGI */
#define _EMU_R5VSTATUS_VBUSGTVREGI_SHIFT                     3                                           /**< Shift value for EMU_VBUSGTVREGI */
#define _EMU_R5VSTATUS_VBUSGTVREGI_MASK                      0x8UL                                       /**< Bit mask for EMU_VBUSGTVREGI */
#define _EMU_R5VSTATUS_VBUSGTVREGI_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_VBUSGTVREGI_DEFAULT                    (_EMU_R5VSTATUS_VBUSGTVREGI_DEFAULT << 3)   /**< Shifted mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_LDODROPOUTDET                          (0x1UL << 4)                                /**< Regulator Dropout Detection */
#define _EMU_R5VSTATUS_LDODROPOUTDET_SHIFT                   4                                           /**< Shift value for EMU_LDODROPOUTDET */
#define _EMU_R5VSTATUS_LDODROPOUTDET_MASK                    0x10UL                                      /**< Bit mask for EMU_LDODROPOUTDET */
#define _EMU_R5VSTATUS_LDODROPOUTDET_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_LDODROPOUTDET_DEFAULT                  (_EMU_R5VSTATUS_LDODROPOUTDET_DEFAULT << 4) /**< Shifted mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_COLDSTART                              (0x1UL << 5)                                /**< Indicates If the Regulator is Going Through a Cold Start */
#define _EMU_R5VSTATUS_COLDSTART_SHIFT                       5                                           /**< Shift value for EMU_COLDSTART */
#define _EMU_R5VSTATUS_COLDSTART_MASK                        0x20UL                                      /**< Bit mask for EMU_COLDSTART */
#define _EMU_R5VSTATUS_COLDSTART_DEFAULT                     0x00000001UL                                /**< Mode DEFAULT for EMU_R5VSTATUS */
#define EMU_R5VSTATUS_COLDSTART_DEFAULT                      (_EMU_R5VSTATUS_COLDSTART_DEFAULT << 5)     /**< Shifted mode DEFAULT for EMU_R5VSTATUS */

/* Bit fields for EMU R5VSYNC */
#define _EMU_R5VSYNC_RESETVALUE                              0x00000000UL                             /**< Default value for EMU_R5VSYNC */
#define _EMU_R5VSYNC_MASK                                    0x00000001UL                             /**< Mask for EMU_R5VSYNC */
#define EMU_R5VSYNC_OUTLEVELBUSY                             (0x1UL << 0)                             /**< 5V Regulator Voltage Register Transfer Busy */
#define _EMU_R5VSYNC_OUTLEVELBUSY_SHIFT                      0                                        /**< Shift value for EMU_OUTLEVELBUSY */
#define _EMU_R5VSYNC_OUTLEVELBUSY_MASK                       0x1UL                                    /**< Bit mask for EMU_OUTLEVELBUSY */
#define _EMU_R5VSYNC_OUTLEVELBUSY_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for EMU_R5VSYNC */
#define EMU_R5VSYNC_OUTLEVELBUSY_DEFAULT                     (_EMU_R5VSYNC_OUTLEVELBUSY_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_R5VSYNC */

